{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "dtype": "float32", "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "batch_input_shape": [null, 784], "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.4, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_5", "activity_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.4, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_6", "activity_regularizer": null, "bias_regularizer": null, "units": 10, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null}}]}