{"keras_version": "2.0.2", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"name": "input_4", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "dtype": "float32", "name": "input_4"}, "class_name": "InputLayer"}, {"name": "conv_0", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_5", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "dropout_8", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_8", "rate": 0.25}, "class_name": "Dropout"}, {"name": "conv_1", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_6", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_6", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "dropout_9", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_9", "rate": 0.25}, "class_name": "Dropout"}, {"name": "flatten_4", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"name": "dense_7", "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Dense"}, {"name": "dropout_10", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_10", "rate": 0.5}, "class_name": "Dropout"}, {"name": "dense_8", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null, "units": 10, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Dense"}], "name": "model_4", "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}