{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv_0", "config": {"kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_0", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "filters": 8, "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "relu_0", "config": {"bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 28, "use_bias": true, "bias_constraint": null, "name": "relu_0", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv_0", 0, 0, {}]]], "class_name": "Dense"}, {"name": "maxpool_0", "config": {"strides": [2, 2], "name": "maxpool_0", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["relu_0", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_1", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["maxpool_0", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "use_bias": true, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model"}