{"config": {"layers": [{"config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "sparse": false}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 8, "kernel_constraint": null, "name": "conv_0", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true}, "name": "conv_0", "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "units": 28, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "relu_0", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "name": "relu_0", "class_name": "Dense", "inbound_nodes": [[["conv_0", 0, 0, {}]]]}, {"config": {"name": "maxpool_0", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "name": "maxpool_0", "class_name": "MaxPooling2D", "inbound_nodes": [[["relu_0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["maxpool_0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "units": 10, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.0.2", "class_name": "Model", "backend": "tensorflow"}