{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "conv_0", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv_0"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 28, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "relu_0", "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true}, "inbound_nodes": [[["conv_0", 0, 0, {}]]], "name": "relu_0"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "maxpool_0", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["relu_0", 0, 0, {}]]], "name": "maxpool_0"}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["maxpool_0", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow"}