{"model_0": {"arch": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_0": [{"filepath": "models/model_0/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_0/conv_layers/conv_0/filter_7.jpg"}]}}]}, "model_5": {"arch": {"input_layers": [["input_5", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "model_5", "layers": [{"class_name": "InputLayer", "name": "input_5", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_5"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv_1", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 16, "bias_constraint": null, "name": "conv_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_7", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_7", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_11", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_11", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_5", "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "name": "dense_9", "inbound_nodes": [[["flatten_5", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_9", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_12", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_12", "trainable": true}}, {"class_name": "Dense", "name": "dense_10", "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_10", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_1": [{"filepath": "models/model_5/conv_layers/conv_1/filter_0.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_1.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_2.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_3.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_4.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_5.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_6.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_7.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_8.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_9.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_10.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_11.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_12.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_13.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_14.jpg"}, {"filepath": "models/model_5/conv_layers/conv_1/filter_15.jpg"}], "conv_0": [{"filepath": "models/model_5/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_5/conv_layers/conv_0/filter_7.jpg"}]}}]}, "model_1": {"arch": {"input_layers": [["input_6", 0, 0]], "output_layers": [["dense_12", 0, 0]], "name": "model_6", "layers": [{"class_name": "InputLayer", "name": "input_6", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_6"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_6", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv_1", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "filters": 16, "bias_constraint": null, "name": "conv_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_8", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_8", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_13", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_13", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_6", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "name": "dense_11", "inbound_nodes": [[["flatten_6", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_11", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_14", "inbound_nodes": [[["dense_11", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_14", "trainable": true}}, {"class_name": "Dense", "name": "dense_12", "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_12", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_1": [{"filepath": "models/model_1/conv_layers/conv_1/filter_0.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_1.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_2.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_3.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_4.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_5.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_6.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_7.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_8.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_9.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_10.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_11.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_12.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_13.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_14.jpg"}, {"filepath": "models/model_1/conv_layers/conv_1/filter_15.jpg"}], "conv_0": [{"filepath": "models/model_1/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_1/conv_layers/conv_0/filter_7.jpg"}]}}]}, "model_2": {"arch": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_4", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_0": [{"filepath": "models/model_2/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_2/conv_layers/conv_0/filter_7.jpg"}]}}]}, "model_3": {"arch": {"input_layers": [["input_3", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_3"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_5", "trainable": true}}, {"class_name": "Conv2D", "name": "conv_1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 16, "bias_constraint": null, "name": "conv_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_6", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_6", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_3", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_5", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_7", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "name": "dense_6", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_6", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_1": [{"filepath": "models/model_3/conv_layers/conv_1/filter_0.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_1.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_2.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_3.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_4.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_5.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_6.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_7.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_8.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_9.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_10.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_11.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_12.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_13.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_14.jpg"}, {"filepath": "models/model_3/conv_layers/conv_1/filter_15.jpg"}], "conv_0": [{"filepath": "models/model_3/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_3/conv_layers/conv_0/filter_7.jpg"}]}}]}, "model_4": {"arch": {"input_layers": [["input_4", 0, 0]], "output_layers": [["dense_8", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_4"}}, {"class_name": "Conv2D", "name": "conv_0", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "filters": 8, "bias_constraint": null, "name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_5", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_8", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_8", "trainable": true}}, {"class_name": "Conv2D", "name": "conv_1", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "filters": 16, "bias_constraint": null, "name": "conv_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_6", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_6", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "name": "dropout_9", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"rate": 0.25, "name": "dropout_9", "trainable": true}}, {"class_name": "Flatten", "name": "flatten_4", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "name": "dense_7", "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "name": "dense_7", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "name": "dropout_10", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_10", "trainable": true}}, {"class_name": "Dense", "name": "dense_8", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_8", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "epochs": [{"conv_layers": {"conv_1": [{"filepath": "models/model_4/conv_layers/conv_1/filter_0.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_1.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_2.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_3.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_4.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_5.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_6.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_7.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_8.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_9.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_10.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_11.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_12.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_13.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_14.jpg"}, {"filepath": "models/model_4/conv_layers/conv_1/filter_15.jpg"}], "conv_0": [{"filepath": "models/model_4/conv_layers/conv_0/filter_0.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_1.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_2.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_3.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_4.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_5.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_6.jpg"}, {"filepath": "models/model_4/conv_layers/conv_0/filter_7.jpg"}]}}]}}