{"keras_version": "2.0.2", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer"}, {"name": "conv_0", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "dropout_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "class_name": "Dropout"}, {"name": "flatten_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"name": "dense_3", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Dense"}, {"name": "dropout_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"name": "dense_4", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null, "units": 10, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Dense"}], "name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0]]}}