{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"layers": [{"name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv_0", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_size": [5, 5], "name": "conv_0", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 8, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "relu_0", "inbound_nodes": [[["conv_0", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_0", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 28, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "maxpool_0", "inbound_nodes": [[["relu_0", 0, 0, {}]]], "config": {"trainable": true, "name": "maxpool_0", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "dropout_3", "inbound_nodes": [[["maxpool_0", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "class_name": "Dropout"}, {"name": "flatten_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"name": "dense_3", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "dense_3", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "dropout_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"name": "dense_4", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"activation": "softmax", "name": "dense_4", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "output_layers": [["dense_4", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "class_name": "Model"}